{
  "translation": {
    "english": "English",
    "russian": "Русский",
    "github_code": "Source code",
    "toggle_color_scheme": "Toggle color scheme",
    "tasks_list": "Tasks list",
    "task_number": "Task {{task}}",
    "open_tasks_list": "Open tasks list",
    "show_tables_structure": "Show tables description",
    "amount_of_tables": "Amount of tables",
    "sql_textarea_label": "Text field for your SQL query",
    "sql_textarea_placeholder": "Enter SQL query...",
    "show_expected_result": "Show expected output",
    "check_answer": "Check answer",
    "next_task": "Next task",
    "error_info": "Error details",
    "tables_description": "Tables description",
    "column_property": "Column property",
    "primary_key": "Primary key",
    "foreign_key_to": "Foreign key to",
    "foreign_key_to_table": "Table",
    "foreign_key_to_column": "Column",
    "outputs": "Outputs",
    "your_outputs": "Your output",
    "here_will_be_your_output": "Here will be your output",
    "expected_output": "Expected output",
    "no_expected_output_for_task": "There is nt expected output for the task",
    "correct_answer": "Correct answer",
    "incorrect_answer": "Incorrect answer",
    "topics": {
      "select": "SELECT",
      "groupBy": "GROUP BY",
      "join": "JOIN"
    },
    "tasks": {
      "select_all_invoices": "Select the list of all invoices with all their attributes.",
      "select_all_artists": "Select the list of all artists with all their attributes.",
      "select_all_artists_names": "Select the list of all artists' names.",
      "select_first_and_last_name_of_employees": "Select the list of first and last names of all employees.",
      "select_employees_sorted_by_hire_date_desc": "Select the list of all employees with all their attributes. Sort the list by hire date in descending order.",
      "select_first_and_last_name_of_employees_sorted_by_hire_date_asc": "Select the list of first and last names of all employees. Sort the list by hire date in ascending order.",
      "select_names_and_length_of_tracks_sorted_by_names_and_milliseconds": "Select the list of titles (column name) and length (column milliseconds) of all tracks. Order the list by track title in alphabetical order. For tracks with a same name sort them by length in descending order.",
      "select_employees_title_support_agent": "Select the list of first and last names of all employees with Sales Support Agent title .",
      "select_tracks_bigger_than_100000000_bytes": "Select titles of tracks (column name), which size exceeds 100000000 bytes.",
      "select_tracks_smaller_than_500000_bytes": "Select titles of tracks (column name), which size is lower than 500000 bytes.",
      "select_tracks_between_500000_and_5000000_bytes": "Select titles of tracks (column name), which size is between 500000 and 5000000 bytes.",
      "select_employees_before_15_feb_2011": "Select the list of hire dates, first and last names of all employees which were hired before 15th February 2011.",
      "select_employees_last_names_starting_with_A": "Select the list of all employees with all their attributes, whos names start with an A.",
      "select_employees_first_names_ending_with_a": "Select the list of all employees with all their attributes, whos nams end with a.",
      "select_employees_with_address_contains_Ave": "Select the list of all employees with all their attributes, whos billing addresses contain Ave.",
      "select_invoices_from_canada_ab": "Select the list of all invoives with all their attributes, where billing country is Canada and billing state is AB.",
      "select_invoices_from_nv_reno_with_total_more_than_5": "Select the list of all invoives with all their attributes, where billing state is NV, billing city is Reno and total equals $5.",
      "select_invoices_from_states_nv_or_ab": "Select the list of all invoives with all their attributes, where billing state is NV or AB.",
      "select_tracks_without_composer": "Select the list of all tracks with all their attributes, where composer is not set.",
      "select_customers_with_company": "Select the list of all customers with all their attributes, which have a company set.",
      "select_invoices_germany_ordered_total_desc_limit_10": "Select top-10 invoices by total. Filter the list by country, it have to be equal to Germany. Select all attributes of all invoices.",
      "select_billing_address_invoices_ca_cupertino_ordered_total_desc_limit_3": "Select top-3 invoices by total. Filter the list by billing state to be CA and billing city to be Cupertino. For all invoices select only billing address.",
      "select_id_invoices_ca_cupertino_or_mountain_view": "Select ID of an invoice with lowest total. Its billing state have to be CA and billing city have to be Mountain View or Cupertino.",
      "count_customers_by_country": "Select the list of all countries and amount of customers in each country.",
      "count_tracks_by_unit_price": "Select unit prices and amount of all tracks of each price.",
      "select_countries_by_customers_desc": "Like in previous task, select unit prices and amount of all tracks of each price. Sort the list from highest to lowest price.",
      "select_top_3_countries_by_customers_desc": "Change the previous solution to show only top-3 of prices.",
      "join_artists_names_and_album_titles": "Select all artists names with all their albums titles.",
      "join_album_titles_and_tracks_titles": "Select all album titles and all tracks titles in each album.",
      "join_artists_names_and_album_titles_ordered_artists_name_desc": "Select all artists names and their albums titles. Sort the list by artist name in reverse alphabetical order.",
      "join_customer_name_and_total_ordered_by_total": "Select all first and last names of all customers and their invoices totals. Sort the list by total from highest to lowest.",
      "select_all_aerosmith_albums": "Select all albums titles of Aerosmith band.",
      "select_all_albums_with_midnight_track": "Select all albums titles, which contains track with title Midnight.",
      "select_all_artists_with_midnight_track": "Select all artist names, who have track with title Midnight. Remember that you can use JOIN twice or more times.",
      "count_iron_maiden_albums": "Count the number of albums of Iron Maiden band.",
      "count_each_albums_of_artists": "Count the number of albums of each artist.",
      "artist_with_max_albums": "Select the artist with most amount of albums. Find it name and the amount of albums.",
      "select_top5_clients_with_most_sum_of_invoices": "Select top-5 customers with higher sum of totals of their invoices."
    }
  }
}
